Public Attributes | List of all members
API_OpeningBaseType Struct Reference
Element Manager
Represents the common part of window, door and skylight elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
 short  | pen
Pen index.
 API_AttributeIndex  | ltypeInd
Line type index.
 API_AttributeIndex  | mat
Material index.
 API_AttributeIndex  | sectFill
Fill index of section of the opening.
 short  | sectFillPen
Pen index of the fill of the section of the opening.
 short  | sectBGPen
Background pen index of the fill of the section of the opening.
 short  | sectContPen
Contour pen index of the fill of the section of the opening.
 API_AttributeIndex  | cutLineType
Line type index for cut lines of the opening.
 API_AttributeIndex  | aboveViewLineType
Line type used when "Overhead All" is selected from the "Floor Plan Display" popup. Corresponds to the "Overhead Lines" value in the Door/Window Settings dialog.
 short  | aboveViewLinePen
Pen used when "Overhead All" is selected from the "Floor Plan Display" popup. Corresponds to the "Overhead Line Pens" value in the Door/Window Settings dialog.
 short  | belowViewLinePen
Pen index of the uncut lines of the opening.
 API_AttributeIndex  | belowViewLineType
Line type used when "OutLines Only" is selected from the "Floor Plan Display" popup. Corresponds to the "Uncut Lines" value in the Door/Window Settings dialog.
 bool  | useObjPens
Use the pens defined in the library part.
 bool  | useObjLtypes
Use the line types defined in the library part.
 bool  | useObjMaterials
Use the materials defined in the library part.
 bool  | useObjSectAttrs
Use the section attributes defined in the library part.
 double  | width
Width of the opening.
 double  | height
Vertical size of the opening.
 double  | subFloorThickness
Sub-floor thickness (used to be Parapet correction ppCorr).
 Int32  | libInd
Index to the symbol in the library. If 0, an empty window/door/skylight hole is created.
 API_VerticalLink  | verticalLink
The anchor position defining how the window/door element to be kept fixed during elevation changes.
 bool  | reflected
True if mirrored to Y axis.
 bool  | oSide
True if mirrored to X axis.
 bool  | refSide
True if mirrored to X axis (same as oSide).
 bool  | wallCutUsing
True if the window inherits the gables of the owner wall.
 GS::Int64  | lookId
Same number for similar-looking windows/doors/skylights 2D draw.
 API_Guid  | markGuid
Guid of the dimension marker symbol.
 API_ElemDisplayOptionsID  | displayOption
Display options of the element on the floor plan (see API_ElemDisplayOptionsID).
Detailed Description
Represents the common part of window, door and skylight elements.
Remarks
This structure is created from API_WindowType to hold the common parameters of API_WindowType and API_SkylightType. For window/door/skylight related memo data see the ACAPI_Element_GetMemo function.